[
  {
    "name": "Depressscape: depression monitoring app",
    "desc": "Depressscape is a novel framework leveraging semantic analysis of social media content to detect early signs of depression, providing users with a 0-100 rating for their distress level. In cases of high depression rates, alerts are sent to emergency contacts. This multilingual system aims to facilitate timely intervention and support worldwide, utilizing natural language processing and predictive algorithms to anticipate future depression trends based on historical data.",
    "image": "Designer",
    "category": "library",
    "links": {
      "view": "https://www.figma.com/file/Wu0UhRsBunXmiLf5F2eFsO/Depressscape?type=design&node-id=0%3A1&mode=design&t=wTlVJtATwNXdfTmP-1",
      "code": "https://www.figma.com/file/Wu0UhRsBunXmiLf5F2eFsO/Depressscape?type=design&node-id=0%3A1&mode=design&t=wTlVJtATwNXdfTmP-1"
    }
  },
  
  {
    "name": "Travel Planner",
    "desc": "The Wanderlust Travel Planner app revolutionizes travel planning with its customizable approach and creative features. Through meticulous research, design, and agile development, it delivers a seamless user experience. By analyzing user preferences and conducting thorough testing, the app ensures relevance and usability. Its modular architecture guarantees scalability and performance, while prioritizing security and interoperability. With intuitive interfaces and personalized recommendations, Wanderlust redefines the travel experience, blending technology with exploration.",
    "image": "travel",
    "category": "hybrid_android",
    "links": {
      "view": "https://www.figma.com/file/F2pOMV22n1DiL860j1r8l6/wireframe-travel-planning?type=design&node-id=0%3A1&mode=design&t=kfd1pMwOOk5DFrtr-1",
      "code": "https://github.com/KashishPatel2629/wanderlust"
    }
  },

  {
    "name": "Portfolio",
    "desc": "I created my own portfoil using HTML, CSS, and JavaScript. I used Figma to design the wireframe and then I used the wireframe to create the website. I used JavaScript to create the hamburger menu and the contact form. I used CSS to style the website and make it responsive. I used HTML to create the structure of the website. I used GitHub to host the website.",
    "image": "portfolio",
    "category": "web_app",
    "links": {
      "view": "https://github.com/KashishPatel2629/Portfolio",
      "code": "https://github.com/KashishPatel2629/Portfolio"
    }
  }
]